20211126141814-how_i_take_reading_notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-01 Thu 10:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How I take reading notes</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">How I take reading notes</h1>
<p>
Taking notes while reading serves two purposes:
</p>
<ol class="org-ol">
<li>It helps me think. These notes are <i>transient</i> and do not need to be kept;</li>
<li>It helps me file important ideas for future use.</li>
</ol>

<p>
When I read a book about a <b>technical topic</b>, say bayesian inference, I open a new notebook on my Remarkable and scribble away. I come back to these <i>transient notes</i> regularly to extract the core concepts, formulas, figures, etc that I want to remember. I type these <i>permanent notes</i> directly on my computer. I sometimes use paper to organize transient notes as it is faster to re-arrange things. The transient notes should then be discarded as they clutter your mind with noise.
</p>

<p>
But this is only practical insofar as I am not reading books in the train or on my couch. For <b>lighter reading</b>, I will mark interesting paragraphs with an asterisk in the margin and take notes with an A7 (not bigger!) notepad that I always have in my pocket. I then move these pieces of paper around until I get a set of fairly self-contained, wannabe-permanent notes.
</p>

<div id="outline-container-orgc43311f" class="outline-2">
<h2 id="orgc43311f">Links to this note</h2>
<div class="outline-text-2" id="text-orgc43311f">
<ul class="org-ul">
<li><a href="./books.html">What I am reading</a></li>
<li><a href="./20220107212604-literature_notes_should_be_kept_separate.html">Literature notes should be kept separate</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>